#include "base_def.h"
#include "include.h"

/*
编写一个函数，输入是一个无符号整数（以二进制串的形式），返回其二进制表达式中数字位数为 '1' 的个数（也被称为汉明重量）。

示例 1：
输入：n = 00000000000000000000000000001011
输出：3
解释：输入的二进制串 00000000000000000000000000001011 中，共有三位为 '1'。

示例 2：
输入：n = 00000000000000000000000010000000
输出：1
解释：输入的二进制串 00000000000000000000000010000000 中，共有一位为 '1'。
*/

INT32S hammingWeight(INT32U n) {
    INT32S count = 0;
    while(n) {
        if (n & 0x1) {
            count++;
        }
        n >>= 1;
    }
    return count;
}

void func191(void)
{
    INT32S ret = hammingWeight(0b00000010100101000001111010011100);
    printf("ret = %d\r\n", ret);
}